# 第五章 CO-RE、BTF 和 Libbpf

在上一章中，您第一次遇到了 BTF（BPF Type Format，BPF 类型格式）。本章讨论它存在的原因以及如何使用它来使 eBPF 程序在不同版本的内核之间可移植。它是 BPF 一次编译、到处运行 (compile once-run everywhere，CO-RE) 方法的关键部分，该方法解决了 eBPF 程序在不同内核版本之间可移植的问题。

许多 eBPF 程序访问内核数据结构体，eBPF 程序员需要包含相关的 Linux 头文件，以便他们的 eBPF 代码可以正确定位这些数据结构体中的字段。然而，Linux 内核正在不断开发，这意味着不同内核版本之间的内部数据结构体可能会发生变化。如果您要将在一台机器上编译的 eBPF 目标文件加载到具有不同内核版本的机器上，则无法保证数据结构体相同。（严格来说，数据结构体定义来自内核头文件，您可以选择基于一组头文件进行编译，其中这组头文件可以与用于构建当前机器上运行的内核的头文件不同。为了正确工作（没有本章中描述的 CO-RE 机制），内核头必须与运行 eBPF 程序的目标机器上的内核兼容。）

CO-RE 方法在高效解决可移植性问题方面迈出了一大步。它允许 eBPF 程序包含编译时的数据结构体布局信息，并提供了一种机制，用于在目标机器上运行时，如果数据结构体布局不同，就调整字段的访问方式。只要程序不访问目标机器内核中根本不存在的字段或数据结构体，程序就可以在不同内核版本之间移植。

在我们深入探讨 CO-RE 如何工作的细节之前，让我们先看看 BCC 项目最初实现内核可移植性的方法，讨论一下为什么它如此受欢迎。

## BCC 的可移植性方法

在第 2 章中，我使用 [BCC](https://github.com/iovisor/bcc) 展示了 eBPF 程序的基本“Hello World”示例。 BCC 项目是第一个用于实现 eBPF 程序的流行项目，为用户空间和内核方面提供了一个框架，对于没有太多内核经验的程序员来说相对容易访问。为了解决跨内核的可移植性，BCC 采用了在运行时、在目标计算机上就地编译 eBPF 代码的方法。这种方法存在许多问题：

- 编译工具链需要安装在您希望运行代码的每台目标计算机上，内核头文件也需要安装（默认情况下并不总是存在）。
- 您必须等待编译完成才能启动该工具，这可能意味着每次启动该工具时都会延迟几秒钟。
- 如果您在大量相同的机器上运行该工具，则在每台机器上重复编译会浪费计算资源。
- 一些基于 BCC 的项目将其 eBPF 源代码和工具链打包到容器镜像中，这使得分发到每台机器变得更容易。但这并不能解决确保内核头文件存在的问题，如果在每台机器上安装多个这样的 BCC 容器，甚至可能意味着更多的重复。
- 嵌入式设备可能没有足够的内存资源来运行编译步骤。

由于这些问题，如果您计划开始开发一个重要的新 eBPF 项目，我不建议使用这种遗留的 BCC 方法，特别是如果您计划将其分发给其他人使用。在本书中，我给出了一些基于 BCC 的示例，因为这是学习 eBPF 基本概念的好方法，特别是因为 Python 用户空间代码非常紧凑且易于阅读。如果您对它比较熟悉，并且想快速完成一些事情，它也是一个很好的选择。但它并不是现代 eBPF 开发的最佳方法。

CO-RE 方法为 eBPF 程序的跨内核可移植性问题提供了更好的解决方案。

> 提示
>
> [github.com/iovisor/bcc](https://github.com/iovisor/bcc) 上的 BCC 项目包含各种命令行工具，用于观察 Linux 机器行为的各种信息。位于 [tools](https://github.com/iovisor/bcc/tree/master/tools) 目录中的原始版本主要是使用我在本节中描述的这种传统的可移植性方法在 Python 中实现的。
>
> 在 BCC 的 [libbpf-tools](https://github.com/iovisor/bcc/tree/master/libbpf-tools) 目录中，您会发现这些用 C 语言编写的工具的更新版本，它们利用了 _libbpf_ 和 CO-RE，并且不会遇到我刚刚列出的问题。它们是一组非常有用的实用程序！

## CO-RE 概述

CO-RE 方法由几个要素组成（本节部分内容改编自“What Is eBPF?”，作者：Liz Rice。一项小型且不科学的调查表明，大多数人将其发音与 core 一词相同，而不是两个音节）：

- _BTF_
  - [BTF](https://docs.kernel.org/bpf/btf.html) 是一种表达数据结构体和函数签名布局的格式。在 CO-RE 中，它用于确定编译时和运行时使用的结构体之间的任何差异。 BTF 还被 bpftool 等工具用来以人类可读的格式转储数据结构体。 Linux 内核从 5.4 开始支持 BTF。
- 内核头
  - Linux 内核源代码包含描述其使用的数据结构体的头文件，并且这些头文件在 Linux 版本之间可能发生变化。 eBPF 程序员可以选择包含单独的头文件，或者，正如您将在本章中看到的，您可以使用 bpftool 从正在运行的系统生成一个名为 _vmlinux.h_ 的头文件，它包含了 BPF 程序可能需要的关于内核的所有数据结构体信息。
- 编译器支持
  - [Clang 编译器得到了增强](https://lists.llvm.org/pipermail/cfe-dev/2021-December/069635.html)，因此当它使用 **-g** 标志编译 eBPF 程序时，它包括所谓的 _CO-RE 重定位_（CO-RE relocations），该重定位源自描述内核数据结构体的 BTF 信息。 GCC 编译器还在[版本 12](https://gcc.gnu.org/gcc-12/changes.html) 中添加了对 BPF 目标的 CO-RE 支持。
- 支持数据结构体重定位的库
  - 当用户空间程序将 eBPF 程序加载到内核中时，CO-RE 方法要求根据编译时的数据结构体与即将运行的目标机器上的数据结构体之间的差异，调整字节码以进行补偿。这基于编译到对象中的 CO-RE 重定位信息。有几个库可以处理这个问题：[libbpf](https://github.com/libbpf/libbpf) 是包含此重定位功能的原始 C 库，Cilium eBPF 库为 Go 程序员提供了相同的功能，Aya 为 Rust 提供了同样的功能。
- 可选地，BPF 框架（skeleton）
  - 可以从编译的 BPF 对象文件自动生成一个框架，其中包含用户空间代码可以调用的便捷函数，用于管理 BPF 程序的生命周期，如将它们加载到内核中、将它们附加到事件等。如果您使用 C 编写用户空间代码，可以使用 **bpftool gen skeleton** 命令生成该框架。这些函数是更高级的抽象，对开发人员来说比直接使用底层库（如 _libbpf_、_cilium/ebpf_ 等）更方便。

> 提示
>
> Andrii Nakryiko 撰写了一篇[出色的博客文章](https://nakryiko.com/posts/bpf-portability-and-co-re/)，描述了 CO-RE 的背景，并阐述了它的工作原理和使用方法。他还编写了规范的 [BPF CO-RE 参考指南](https://nakryiko.com/posts/bpf-core-reference-guide/#bpf-core-read)，因此如果您要自己编写代码，请务必阅读该指南。他的 [libbpf-bootstrap 指南](https://nakryiko.com/posts/libbpf-bootstrap/)使用 CO-RE + libbpf + sketchs 从头开始构建 eBPF 应用程序是另一个必读的内容。

现在，您已经对 CO-RE 的要素有了一个大致的了解，让我们从探讨 BTF 开始，深入了解它们是如何工作的。

## BPF 类型格式（BPF Type Format）

BTF 信息描述了数据结构体和代码在内存中的布局方式。这些信息可以有多种不同的用途。

### BTF 用例

在 CO-RE 章节中讨论 BTF 的主要原因是，了解编译 eBPF 程序的结构体布局与将要运行的结构体布局之间的差异，可以在程序加载到内核时进行适当的调整。我将在本章后面讨论重定位过程，但是现在，让我们考虑一下 BTF 信息的其他用途。

了解结构体的布局方式以及该结构体中每个字段的类型，可以以人类可读的形式漂亮地打印结构体的内容。例如，从计算机的角度来看，字符串只是一系列字节，但是将这些字节转换为字符使字符串更容易被人类理解。您已经在前一章中看到了这样的示例，其中 **bpftool** 使用 BTF 信息来格式化映射转储的输出。

BTF 信息还包括行和函数信息，这些信息使 **bpftool** 能够在翻译或即时编译后的程序转储的输出中交错输出源代码，如您在第 3 章中看到的那样。当您阅读第 6 章时，您还将看到源代码信息与验证器日志输出交错在一起，这也来自 BTF 信息。

BPF 自旋锁也需要 BTF 信息。*自旋锁*用于阻止两个 CPU 核心同时访问相同的 map 值。锁必须作为 map 值结构体的一部分，如下所示：

```c
struct my_value {
    ... <other fields>
    struct bpf_spin_lock lock;
... <other fields>
};
```

在内核中，eBPF 程序使用 **bpf_spin_lock()** 和 **bpf_spin_unlock()** 辅助函数来获取和释放锁。只有当 BTF 信息可以描述锁字段在结构体中的位置时，才能使用这些辅助程序。

> 提示
>
> 内核版本 5.1 中添加了自旋锁支持。自旋锁的使用有很多限制：它们只能用于哈希或数组 map 类型，并且不能用于跟踪或套接字过滤器类型的 eBPF 程序。请阅读 [lwn.net 有关 BPF 并发管理](https://lwn.net/Articles/779120/)文章，了解有关自旋锁的更多信息。

现在您已经知道为什么 BTF 信息有用，让我们通过一些示例来更具体地了解。

### 使用 bpftool 列出 BTF 信息

与程序和 map 一样，您可以使用 **bpftool** 实用程序来显示 BTF 信息。以下命令列出了加载到内核中的所有 BTF 数据：

```bash
bpftool btf list
1: name [vmlinux] size 5843164B
2: name [aes_ce_cipher] size 407B
3: name [cryptd] size 3372B
...
149: name <anon> size 4372B prog_ids 319 map_ids 103
        pids hello-buffer-co(7660)
155: name <anon> size 37100B
        pids bpftool(7784)
```

（为了简洁起见，我省略了结果中的许多条目。）

列表中的第一个条目是 **vmlinux**，它对应于我之前提到的 _vmlinux_ 文件，该文件保存有关当前运行的内核的 BTF 信息。

> 提示
>
> 本章前面的一些示例重用了第 4 章中的程序，然后在本章后面您将找到新示例，其源代码位于 [github.com/lizrice/learning-ebpf](https://github.com/lizrice/learning-ebpf) 的 Chapter5 目录中。

为了获得这个示例输出，我在运行第 4 章中的 **hello-buffer-config** 示例时运行了此命令。您可以在以 **149:** 开头的行上看到描述此进程正在使用的 BTF 信息的条目：

```bash
149: name <anon> size 4372B prog_ids 319 map_ids 103
        pids hello-buffer-co(7660)
```

这行带给我们的信息有：

- 这块 BTF 信息的 ID 为 149。
- 这是一个大约 4 KB BTF 信息的匿名 blob。
- 它由 **prog_id 319** 的 BPF 程序和 **map_id 103** 的 BPF 映射使用。
- 它还被 ID 为 7660（显示在括号内）的进程使用，该进程运行 **hello-buffer-config** 可执行文件（其名称已被截断为 15 个字符）。

这些程序、map 和 BTF 标识符与 **bpftool** 显示的有关 **hello-buffer-config** 名为 **hello** 的程序的以下输出相匹配：

```bash
bpftool prog show name hello
319: kprobe name hello tag a94092da317ac9ba gpl
        loaded_at 2022-08-28T14:13:35+0000 uid 0
        xlated 400B jited 428B memlock 4096B map_ids 103,104
        btf_id 149
        pids hello-buffer-co(7660)
```

这两组信息之间唯一看起来不完全匹配的是程序引用了一个额外的 **map_id, 104**。这是 perf 事件缓冲区 map，它不使用 BTF 信息；因此，它不会出现在 BTF 相关输出中。

就像 bpftool 可以转储程序和 map 的内容一样，它也可以用于查看数据块中包含的 BTF 类型信息。

### BTF 类型

知道 BTF 信息的 ID 后，您可以使用命令 **bpftool btf dump id \<id\>** 检查其内容。当我使用之前获得的 ID 149 运行此程序时，我得到了 69 行输出，每行都是一个类型定义。我将只描述前几行，这应该可以让您很好地了解如何解释其余的内容。前几行的 BTF 信息与配置哈希 map 相关，它在源代码中定义如下：

```c
struct user_msg_t {
    char message[12];
};
BPF_HASH(config, u32, struct user_msg_t);
```

该哈希表的键类型为 **u32**，值类型为结构体 **user_msg_t**。该结构体包含一个 12 字节的 **message** 字段。让我们看看在相应的 BTF 信息中是如何定义这些类型的。

BTF 输出的前三行如下：

```bash
[1] TYPEDEF 'u32' type_id=2
[2] TYPEDEF '__u32' type_id=3
[3] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```

每行开头方括号中的数字是类型 ID（因此，以 **[1]** 开头的第一行定义了 **type_id 1**，等等）。让我们更详细地探讨这三种类型：

- 类型 1 定义了一个名为 u32 的类型，其类型由 **type_id 2** 定义，即以 [2] 开头的行中定义的类型。如您所知，哈希表中的键的类型为 u32。
- 类型 2 的名称为 **\_\_u32**，类型由 **type_id 3** 定义。
- 类型 3 是一个整数类型，名称为 **unsigned int**，长度为 4 个字节。

上面这三种类型都是 32 位无符号整数类型的同义词。在 C 语言中，整数的长度与平台相关，因此 Linux 定义了像 **u32** 这样的类型来显式定义特定长度的整数。在本机上，**u32** 对应于无符号整数。引用这些的用户空间代码应该使用带下划线前缀的同义词，如 **\_\_u32**。

BTF 输出中的接下来的几种类型如下所示：

```bash
[4] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=6 bits_offset=0
[5] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=(none)
[6] ARRAY '(anon)' type_id=5 index_type_id=7 nr_elems=12
[7] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```

这些与用于 **config** map 中的值的 **user_msg_t** 结构体相关：

- 类型 4 是 **user_msg_t** 结构本身，总共 12 个字节长。它包含一个名为 **message** 的字段，该字段由类型 6 定义。 **vlen** 字段指示此定义中有多少个字段。
- 类型 5 被命名为 **char**，是一个 1 字节整数——这正是 C 程序员对 "char "类型的期望定义。
- 类型 6 将该 **message** 字段的类型定义为包含 12 个元素的数组。每个元素的类型为 5（它是一个字符），数组的索引为类型 7。
- 类型 7 是一个 4 字节整数。

通过这些定义，您可以完整了解 **user_msg_t** 结构体在内存中的布局，如图 5-1 所示。

![](./figure-5-1.png)

_图 5-1. **user_msg_t** 结构体占用 12 字节内存_

到目前为止，所有条目的 **bits_offset** 都设置为 0，但下一行输出的结构体包含多个字段：

```bash
[8] STRUCT '____btf_map_config' size=16 vlen=2
        'key' type_id=1 bits_offset=0
        'value' type_id=4 bits_offset=32
```

这是存储在名为 **config** 的 map 中的键值对的结构定义。我没有在源代码中定义这个**btf_map_config** 类型，但它是由 BCC 生成的。键的类型为 **u32**，值是 **user_msg_t** 结构体。这些对应于您之前看到的类型 1 和 4。

关于该结构体的 BTF 信息的另一个重要部分是值字段在该结构开始后的 32 位开始。这完全有道理，因为需要前 32 位来保存键字段。

> 提示
>
> 在 C 中，结构体字段会自动与边界对齐，因此您不能简单地假设一个字段始终紧跟在内存中的前一个字段之后。例如，考虑这样的结构：
>
> ```c
> struct something {
>     char letter;
>     u64 number;
> }
> ```
>
> 在 **letter** 的字段之后、 **number** 字段之前将有 7 个字节的未使用内存，以便将 64 位 **number** 对齐到可被 8 整除的内存位置。
>
> 在某些情况下，可以打开编译器打包来避免这种未使用的空间，但它通常会降低性能，而且（至少根据我的经验）这样做是不寻常的。更多时候，C 程序员会手工设计结构体以有效利用空间。

### 带有 BTF 信息的 map

您刚刚看到了与 map 相关的 BTF 信息。现在让我们看看在创建 map 时，如何将这些 BTF 数据传递给内核。

您在第 4 章中看到，map 是使用 **bpf(BPF_MAP_CREATE)** 系统调用创建的。这需要一个 **bpf_attr** 结构体作为参数，[在内核中定义](https://elixir.bootlin.com/linux/v5.19.17/source/include/uapi/linux/bpf.h#L1273)如下（省略一些细节）：

```c
struct { /* anonymous struct used by BPF_MAP_CREATE command */
    __u32    map_type;    /* one of enum bpf_map_type */
    __u32    key_size;    /* size of key in bytes */
    __u32    value_size;    /* size of value in bytes */
    __u32    max_entries;    /* max number of entries in a map */
    ...
    char    map_name[BPF_OBJ_NAME_LEN];
    ...
    __u32    btf_fd;        /* fd pointing to a BTF type data */
    __u32    btf_key_type_id;    /* BTF type_id of the key */
    __u32    btf_value_type_id;    /* BTF type_id of the value */
    ...
};
```

在引入 BTF 之前，**bpf_attr** 结构中不存在 **btf\_\*** 字段，并且内核不知道键或值的结构。 key_size 和 value_size 字段定义了它们需要多少内存，但它们只是被视为这么多字节。通过额外传入定义键和值类型的 BTF 信息，内核可以深入理解他们，并且像 bpftool 这样的实用程序可以检索类型信息以进行漂亮打印，如前所述。然而，值得注意的是，键和值分别传入了单独的 BTF **type_id**。您刚刚看到定义的 **btf_map_config** 结构并未被内核用于 map 定义；它仅由 BCC 在用户空间使用。

### 函数和函数原型的 BTF 数据

到目前为止，本示例输出中的 BTF 数据与数据类型相关，但 BTF 数据还包含有关函数和函数原型的信息。下面是同一个 BTF 数据 blob 中描述 **hello** 函数的信息：

```bash
[31] FUNC_PROTO '(anon)' ret_type_id=23 vlen=1
        'ctx' type_id=10
[32] FUNC 'hello' type_id=31 linkage=static
```

在类型 32 中，您可以看到名为 hello 的函数被定义为具有上一行中定义的类型。这是一个函数原型，它返回类型 ID 23 的值，并采用一个(**vlen=1**)名为 **ctx** 的参数 ，类型 ID 为 10。为了完整起见，以下是前面输出中这些类型的定义：

```bash
[10] PTR '(anon)' type_id=0

[23] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
```

类型 10 是一个匿名指针，默认类型为 0，它没有显式地包含在 BTF 输出中，但被定义为 void 指针。（请参阅 [https://docs.kernel.org/bpf/btf.html#type-encoding](https://docs.kernel.org/bpf/btf.html#type-encoding) 上的内核文档。）

类型 23 的返回值为 4 字节整数，**encoding=SIGNED** 表示为有符号整数；也就是说，它可以具有正值或负值。这对应于 _hello-buffer-config.py_ 源代码中的函数定义，如下所示：

```c
int hello(void *ctx)
```

到目前为止，我展示的示例 BTF 信息来自列出 BTF 数据 blob 的内容。让我们看看如何获取与特定 map 或程序相关的 BTF 信息。

### 检查 map 和程序的 BTF 数据

如果您想检查与特定 map 关联的 BTF 类型，bpftool 可以帮助您轻松实现。例如，这是 **config** map 的输出：

```bash
bpftool btf dump map name config
[1] TYPEDEF 'u32' type_id=2
[4] STRUCT 'user_msg_t' size=12 vlen=1
    'message' type_id=6 bits_offset=0
```

同样，您可以使用 **bpftool btf dump prog \<prog Identity\>** 检查与特定程序相关的 BTF 信息。更多详情请查看[手册](https://manpages.ubuntu.com/manpages/jammy/man8/bpftool-btf.8.html)。

> 提示
>
> 如果您想更好地了解 BTF 类型数据是如何生成和去重的，Andrii Nakryiko 就该主题撰写了另一篇精彩的[博客文章](https://nakryiko.com/posts/btf-dedup/)。

到此阶段，您应该了解 BTF 如何描述数据结构和函数的格式。用 C 编写的 eBPF 程序需要定义类型和结构体的头文件。让我们看看为 eBPF 程序可能需要的任何内核数据类型生成头文件是多么容易。

## 生成内核头文件

如果您在支持 BTF 的内核上运行 **bpftool btf list**，您将看到许多预先存在的 BTF 数据块，如下所示：

```bash
$ bpftool btf list
1: name [vmlinux] size 5842973B
2: name [aes_ce_cipher] size 407B
3: name [cryptd] size 3372B
...
```

此列表中的第一项 ID 为 1，名为 **vmlinux**，是有关在此（虚拟）计算机上运行的内核使用的所有数据类型、结构体和函数定义的 BTF 信息。（内核需要在启用 **CONFIG_DEBUG_INFO_BTF** 选项的情况下构建。）

eBPF 程序需要它所引用的任何内核数据结构体和类型的定义。在 CO-RE 出现之前，您通常必须弄清楚 Linux 内核源代码中的许多单独头文件中的哪些包含您感兴趣的结构的定义，但现在有一种更简单的方法，因为支持 BTF 的工具可以从内核包含的 BTF 信息中生成一个合适的头文件。

该头文件通常称为 _vmlinux.h_，您可以使用 **bpftool** 生成它，如下所示：

```bash
bpftool btf dump file /sys/kernel/btf/vmlinux format c > vmlinux.h
```

该文件定义了所有内核的数据类型，因此在您的 eBPF 程序源代码中包含此生成的 _vmlinux.h_ 文件可提供您可能需要的任何 Linux 数据结构体的定义。当您将源代码编译为 eBPF 目标文件时，该目标文件将包含与头文件中定义相匹配的 BTF 信息。稍后，当程序在目标计算机上运行时，将其加载到内核的用户空间程序将根据编译时的 BTF 信息和目标机器上运行的内核的 BTF 信息之间的差异进行调整。

自版本 5.4 以来（哪个是支持 BTF 的最旧的 Linux 内核版本？请参阅[这个](https://lists.iovisor.org/g/iovisor-dev/message/1966)），_/sys/kernel/btf/vmlinux_ 文件形式的 BTF 信息已包含在 Linux 内核中，但也可以为较旧的内核生成 libbpf 可以使用的原始 BTF 数据。换句话说，如果您想在还没有 BTF 信息的目标机器上运行支持 CO-RE 的 eBPF 程序，您可以自己为目标机提供 BTF 数据。 [BTFHub](https://github.com/aquasecurity/btfhub) 上提供了有关如何生成 BTF 文件的信息，以及各种 Linux 发行版的文件存档。

> 提示
>
> 如果您想更深入地了解这个主题，BTFHub 存储库还包括有关 [BTF internals](https://github.com/aquasecurity/btfhub/blob/main/docs/btfgen-internals.md) 的进一步阅读。

接下来，让我们看看如何使用 CO-RE 来编写跨内核可移植的 eBPF 程序。

## CO-RE eBPF 程序

您应该记得 eBPF 程序在内核中运行。在本章后面，我将展示一些将与内核中运行的代码交互的用户空间代码，但在本节中我将重点关注内核端。

正如您已经看到的，eBPF 程序被编译为 eBPF 字节码，并且（至少在撰写本文时）支持此功能的编译器是用于编译 C 代码的 Clang 或 gcc 以及 Rust 编译器。我将在第 10 章中讨论使用 Rust 的一些选项，但就本章而言，我假设您使用 C 语言编写并使用 Clang 以及 _libbpf_ 库。

在本章的剩余部分，我们将考虑一个名为 _hello-buffer-config_ 的示例应用程序。它与上一章中使用 BCC 框架的 _hello-buffer-config.py_ 示例非常相似，但该版本是用 C 编写的，以使用 _libbpf_ 和 CO-RE。

如果您有基于 BCC 的 eBPF 代码想要迁移到 libbpf，请在 Andrii Nakryiko 的网站上查看出色且全面的[指南](https://nakryiko.com/posts/bcc-to-libbpf-howto-guide/#bpf-code-conversion)。 BCC 提供了一些方便的快捷方式，这些快捷方式与使用 _libbpf_ 的处理方式不同；相反，_libbpf_ 提供了自己的一组宏和库函数，以使 eBPF 程序员更轻松。在演示该示例时，我将指出 BCC 和 _libbpf_ 方法之间的一些差异。

> 提示
>
> 您可以在 [github.com/lizrice/learning-ebpf](https://github.com/lizrice/learning-ebpf) 存储库的 _chapter5_ 目录中找到本节附带的示例 C eBPF 程序。

首先我们看一下 _hello-buffer-config.bpf.c_，它实现了在内核中运行的 eBPF 程序。在本章后面，我将向您展示 _hello-buffer-config.c_ 中的用户空间代码，该代码加载程序并显示输出，就像第 4 章中此示例的 BCC 实现中的 Python 代码所做的那样。

与任何 C 程序一样，eBPF 程序需要包含一些头文件。

### 头文件

_hello-buffer-config.bpf.c_ 的前几行指定了它需要的头文件：

```c
#include "vmlinux.h"
#include <bpf/bpf_helpers.h>
#include <bpf/bpf_tracing.h>
#include <bpf/bpf_core_read.h>
#include "hello-buffer-config.h"
```

这五个文件是 _vmlinux.h_ 文件、_libbpf_ 中的一些头文件以及我自己编写的用于应用程序的头文件。让我们看看为什么这是 _libbpf_ 程序所需的头文件的典型模式。

#### 内核头信息

如果您正在编写引用任何内核数据结构体或类型的 eBPF 程序，最简单的选择是包含本章前面描述的 _vmlinux.h_ 文件。或者，如果您确实想解决这个问题，也可以包含来自 Linux 源代码的单独头文件，或者在您自己的代码中手动定义类型。如果您要使用 _libbpf_ 中的任何 BPF 辅助函数，则需要包含 _vmlinux.h_ 或 _linux/types.h_ 来获取 BPF 辅助函数源代码所引用的 **u32**、**u64** 等类型的定义。

_vmlinux.h_ 文件源自内核源代码头文件，但它不包含其中的 **#define** 定义的值。例如，如果您的 eBPF 程序解析以太网数据包，您可能需要常量定义来告诉您数据包包含什么协议（例如 **0x0800** 表示它是 IP 数据包，或 **0x0806** 表示 ARP 数据包）。如果您不包含为内核定义这些值的 [_if_ether.h_ 文件](https://elixir.bootlin.com/linux/v5.19.4/source/include/uapi/linux/if_ether.h#L52)，则需要在自己的代码中复制一系列常量值。我不需要在 _hello-buffer-config_ 中定义这些值，但您会在第 8 章中看到另一个与之相关的示例。

#### 来自 libbpf 的头文件

要在 eBPF 代码中使用任何 BPF 辅助函数，您需要包含 libbpf 中提供其定义的头文件。

> 提示
>
> 关于 _libbpf_ 可能有点令人困惑的一件事是它不仅仅是一个用户空间库。您会发现自己在用户空间和 eBPF C 代码中都包含了 _libbpf_ 的头文件。

在写这篇文章的时候，我们经常看到 eBPF 项目将 _libbpf_ 作为一个子模块，并从源代码开始构建/安装——我在本书的示例资源库中就是这样做的。如果您把它作为一个子模块，您只需要在 _libbpf/src_ 目录下运行 **make install**。我认为不久的将来，_libbpf_ 就会作为一个软件包广泛地出现在常见的 Linux 发行版上，尤其是*libbpf* 现在已经通过了[1.0 版本](https://nakryiko.com/posts/libbpf-v1/)的里程碑。

